var E0001 = "E:E0001:รูปแบบวันที่ไม่ถูกต้อง";
var E0002 = "E:E0002:วันที่สิ้นสุดการใช้งานต้องมากกว่าวันที่เริ่มต้น";
var E0003 = "E:E0003:ไม่พบข้อมูลตามเงื่อนไขที่ระบุ";
var E0004 = "E:E0004:กรุณาระบุเงื่อนไขอย่างใดอย่างหนึ่ง";
var E0005 = "E:E0005:ท่านไม่มีสิทธิใช้โปรแกรมนี้ กรุณาติดต่อเจ้าหน้าที่กยศ.";
var E0006 = "E:E0006:กรุณาระบุวันเดือนปีที่รับ";
var E0007 = "E:E0007:กรุณาระบุรหัสผู้ประกอบการ";
var E0008 = "E:E0008:กรุณาระบุวันที่";
var E0009 = "E:E0009:กรุณาระบุประเภทผู้ประกอบการ";
var E0010 = "E:E0010:กรุณาระบุรหัสโรงอุตสาหกรรม";
var E0011 = "E:E0011:กรุณาระบุ";
var E0012 = "E:E0012:กรุณาเลือก";
var E0013 = "E:E0013:รหัสสำนักงานสรรพสามิต ต้องบันทึกเป็นตัวเลขขนาด 6 หลัก";
var E0014 = "E:E0014:ไม่พบรหัสสำนักงานสรรพสามิต ที่ระบุ";
var E0015 = "E:E0015:กรุณาระบุเดือน";
var E0016 = "E:E0016:กรุณาระบุปี";
var E0017 = "E:E0017:กรุณาระบุผู้ประกอบการ";
var E0018 = "E:E0018:กรุณาเลือกรายการสินค้าจากแถบรายการสินค้า";
 
// ใช้ในกรณีต้องการให้ระบุค่ามากกว่า 
// เช่น showMsg(E0019) + " 0.00" หมายถึง "ค่าที่บันทึกต้องมากกว่า 0.00"
// หรือ showMsgField(E0019, "อัตราภาษีมูลค่าเพิ่ม") + " 0.00" หมายถึง "อัตราภาษีมูลค่าเพิ่ม ค่าที่บันทึกต้องมากกว่า 0.00"
var E0019 = "E:E0019:ค่าที่บันทึกต้องมากกว่า";
// ใช้ในกรณีต้องการให้ระบุค่ามากกว่า
// เช่น showMsg(E0019) + " 0.00" หมายถึง "ค่าที่บันทึกต้องมากกว่า 0.00"
// หรือ showMsgField(E0019, "อัตราภาษีมูลค่าเพิ่ม") + " 0.00" หมายถึง "อัตราภาษีมูลค่าเพิ่ม ค่าที่บันทึกต้องมากกว่า 0.00"
var E0020 = "E:E0020:ต้องไม่มากกว่า";
var E0021 = "E:E0021:ปีต้องมีค่าตั้งแต่ปี 2450 เป็นต้นไป";
var E0022 = "E:E0022:รูปแบบวันที่ไม่ถูกต้อง เนื่องจาก วันที่ เดือน และปีไม่สอดคล้องกันเช่น\n31042545 ไม่ถูกต้องเนื่องจากเดือน 04 หรือ เมษายน มีเพียง 30 วันเท่านั้น หรือ\n29022545 ไม่ถูกต้องเนื่องจากปีพ.ศ. 2545 เดือนกุมภาพันธ์มี 28 วันเป็นต้น";
var E0023 = "E:E0023:ระบุเดือนไม่ถูกต้อง ให้ระบุเป็น 01 - 12 เท่านั้น";
var E0024 = "E:E0024:รูปแบบวันที่ไม่ถูกต้อง เนื่องจาก\n ความยาวมากกว่า หรือน้อยกว่า 8 ตัวอักษร";
var E0025 = "E:E0025:รูปแบบวันที่ไม่ถูกต้อง เนื่องจาก\n1. ประกอบด้วยตัวอักษรอื่นนอกจากตัวเลข  0-9 \n2. มีเครื่องหมายอื่นๆประกอบอยู่ด้วยเช่น / เป็นต้น";
var E0026 = "E:E0026:วันที่ที่บันทึกต้องน้อยกว่าหรือเท่ากับวันที่ในระบบ";
var E0027 = "E:E0027:ต้องไม่น้อยกว่า";
var E0028 = "E:E0028:รูปแบบปีพ.ศ.ไม่ถูกต้อง เนื่องจาก\n ความยาวมากกว่า หรือน้อยกว่า 4 ตัวอักษร";

var E1001 = "E:E1001:พบข้อผิดพลาดขณะค้นหาข้อมูล"; 
var E1002 = "E:E1002:ค่าสูงสุดที่บันทึกได้คือ 100.00";
var E1003 = "E:E1003:มูลค่าสูงสุดของขั้นต้องมากกว่ามูลค่าต่ำสุดของขั้น";
var E1004 = "E:E1004:รหัสกลุ่มรหัสรายได้ต้องมีสถานะเป็นกลุ่มรายได้เท่านั้น"; 
var E1005 = "E:E1005:ไม่สามารถบันทึกเป็นค่าเดียวกับรหัสรายได้"; 
var E1006 = "E:E1006:รหัสกลุ่มหมวดสินค้าไม่สามารถเป็นค่าเดียวกับรหัสหมวดสินค้าได้"; 
var E1007 = "E:E1007:รหัสกลุ่มหมวดสินค้าต้องเป็นรหัสของกลุ่มหมวดสินค้าเท่านั้น"; 

var E2001 = "E:E2001:รหัสอ้างอิงจากเมนูไม่สามารถเป็นค่าเดียวกับรหัสเมนูระบบงานได้"; 
var E2002 = "E:E2002:รหัสอ้างอิงจากเมนูต้องเป็นรหัสของเมนูหลักเท่านั้น"; 

var E3001 = "E:E3001:เลขควบคุมเอกสารที่ระบุ เป็นแบบที่ไม่สามารถบันทึกข้อมูลบัญชีผู้เสียภาษีได้"; 
var E3002 = "E:E3002:สถานะของแบบใหม่ไม่สามารถเป็นค่าเดียวกับสถานะของแบบเดิมได้"; 
    
var E4001 = "E:E4001:เลขประจำตัวผู้เสียภาษีอากรจะต้องบันทึกเป็นตัวเลขจำนวน 10 หลัก";
var E4002 = "E:E4002:กรุณาระบุข้อมูลที่ต้องการลบ";
var E4003 = "E:E4003:ไม่พบข้อมูลจาก MOI";
var E4004 = "E:E4004:ไม่พบข้อมูลจาก MOC"; 
var E4005 = "E:E4005:ไม่สามารถบันทึกข้อมูลได้ เนื่องจากมีข้อมูลสถานประกอบการนี้ในฐานข้อมูลแล้ว";
var E4006 = "E:E4006:เลขทะเบียนสรรพสามิตต้องมีความยาว 10 หลักเท่านั้น";
var E4007 = "E:E4007:ระบุช่วงวันที่ไม่ถูกต้อง 'จดทะเบียนวันที่ต้องน้อยกว่าหรือเท่ากับ ถึงวันที่' ";
var E4008 = "E:E4008:ยังไม่ทำการพิมพ์ทะเบียนสรรพสามิต ไม่สามารถทำรายการนี้ได้"; //ใช้ใน REGE0105
var E4009 = "E:E4009:พบข้อมูลของผู้ประกอบการอยู่ในระบบแล้ว ต้องการปรับปรุงแทนข้อมูลเก่าหรือไม่";//ใช้ในREGE...
var E4010 = "E:E4010:มีข้อมูลของผู้ประกอบการอยู่ในระบบแล้ว";//ใช้ในREGE0001...
var E4011 = "E:E4011:พบข้อมูลชื่อสถานประกอบการอยู่ในระบบแล้ว ต้องการปรับปรุงแทนข้อมูลเก่าหรือไม่";//ใช้ในREGE...
var E4012 = "E:E4012:มีข้อมูลชื่อสถานประกอบการอยู่ในระบบแล้ว";//ใช้ในREGE0002...
var E4013 = "E:E4013:เลขใบอนุญาตตั้งคลังสินค้าทัณฑ์บนที่บันทึกไม่ถูกต้องตามหลักเกณฑ์";
var E4014 = "E:E4014:เลขใบอนุญาตตั้งสถานแสดงรถยนต์เพื่อขายที่บันทึกไม่ถูกต้องตามหลักเกณฑ์";
var E4015 = "E:E4015:เลขทะเบียนสรรพสามิตที่บันทึกไม่ถูกต้องตามหลักเกณฑ์";
var E4016 = "E:E4016:กรุณาระบุรายชื่อรถยนต์ที่อยู่ในสถานแสดงรถยนต์เพื่อขาย";
var E4017 = "E:E4017:ไม่พบข้อมูลเลขที่ใบอนุญาต"; 
var E4018 = "E:E4018:กรุณาระบุรายชื่อและที่อยู่ของสถานแสดงรถยนต์เพื่อขาย";
var E4019 = "E:E4019:สถานแสดงรถยนต์เพื่อขายนี้มีเลขที่ใบอนุญาตในระบบแล้ว ";
var E4020 = "E:E4020:เลขใบอนุญาตไม่ถูกต้องตามหลักเกณฑ์";
var E4021 = "E:E4021:วันที่ยกเลิกต้องมากกว่าวันที่จดทะเบียน";
var E4022 = "E:E4022:เลขทะเบียนสรรพสามิต ยังไม่มีการจดทะเบียนใหม่ไม่สามารถทำรายการนี้ได้";
var E4023 = "E:E4023:เลขทะเบียนสรรพสามิต ถูกยกเลิการใช้งานแล้ว";
var E4024 = "E:E4024:วันที่โอนกิจการต้องมากกว่าวันที่จดทะเบียน";
var E4025 = "E:E4025:เลขทะเบียนสรรพสามิตถูกยกเลิกและยังค้างการชำระภาษี";
var E4026 = "E:E4026:ถ้าไม่มีจำนวนเงินให้ระบุ 0 เท่านั้น"; 
var E4027 = "E:E4027:กรุณาระบุรายการที่ต้องการแก้ไข"; 
var E4028 = "E:E4028:ยังไม่เคยทำรายการของแบบฟอร์มนี้ ไม่สารมารถแก้ไขข้อมูลได้"; 
var E4029 = "E:E4029:กรุณาระบุชื่อผู้รับโอน"; 
var E4030 = "E:E4030:ยังไม่ทำการพิมพ์ใบอนุญาตตั้งคลังสินค้าทัณฑ์บน ไม่สามารถทำรายการนี้ได้"; // ใช้ใน REGE0109
var E4031 = "E:E4031:คลังสินค้าทัณฑ์บนนี้ มีใบอนุญาตแล้ว"; // ใช้ใน REGE0108
var E4032 = "E:E4032:เลขที่ใบอนุญาตนี้ยังไม่ทำการอนุมัติให้ใช้งาน ไม่สามารถทำรายการโอนคลังสินค้าทัณฑ์บนได้"; // ใช้ใน REGE0110
var E4033 = "E:E4033:เลขที่ใบอนุญาตนี้ ไม่สามารถทำรายการนี้ได้"; // ใช้ใน REGE0111


var E5000 = "E:E5000:ไม่พบข้อมูล" ;
var E5001 = "E:E5001:กรุณาระบุรหัสกลุ่มสินค้า" ;
var E5002 = "E:E5002:กรุณาระบุชื่อกลุ่มสินค้า" ;
var E5003 = "E:E5003:กรุณาระบุรหัสประเภทสินค้า/บริการ" ;
var E5004 = "E:E5004:กรุณาระบุชื่อประเภทสินค้า/บริการ" ;
var E5005 = "E:E5005:กรุณาระบุรหัสเครื่องหมายการค้าหลัก" ;
var E5006 = "E:E5006:กรุณาระบุชื่อเครื่องหมายการค้าหลัก" ;
var E5007 = "E:E5007:กรุณาระบุรหัสเครื่องหมายการค้ารอง" ;
var E5008 = "E:E5008:กรุณาระบุชื่อเครื่องหมายการค้ารอง" ;
var E5009 = "E:E5009:กรุณาระบุอัตราภาษีตามมูลค่าหรืออัตราภาษีตามปริมาณ" ;
var E5010 = "E:E5010:กรุณาระบุปริมาณที่ใช้เป็นฐานในการเก็บภาษี" ;
var E5011 = "E:E5011:กรุณาระบุรหัสหน่วยสินค้า" ;
var E5012 = "E:E5012:กรุณาระบุชื่อหน่วยสินค้า" ;
var E5013 = "E:E5013:กรุณาระบุรหัสแบบ/รุ่น" ;
var E5014 = "E:E5014:กรุณาระบุรายละเอียดแบบ/รุ่น" ; 
var E5015 = "E:E5015:กรุณาระบุรหัสประเภทสินค้าย่อย" ;
var E5016 = "E:E5016:กรุณาระบุรายละเอียดประเภทสินค้าย่อย" ;
var E5017 = "E:E5017:กรุณาระบุชื่อสินค้า" ;
var E5018 = "E:E5018:กรุณาระบุเลือกกลุ่มสินค้า" ;
var E5019 = "E:E5019:กรุณาระบุขนาดหลุม" ;
var E5020 = "E:E5020:กรุณาระบุรายละเอียดบริการ" ;
var E5021 = "E:E5021:กรุณาระบุแรงแอลกอฮอล์" ;
var E5022 = "E:E5022:กรุณาระบุภาชนะบรรจุ" ;
var E5023 = "E:E5023:กรุณาระบุขนาดภาชนะบรรจุ" ;
var E5024 = "E:E5024:กรุณาระบุขนาดบรรจุ" ;
var E5025 = "E:E5025:กรุณาระบุวันที่ในการสำรวจ" ;
var E5026 = "E:E5026:กรุณาระบุครั้งที่ในการสำรวจ" ;
var E5027 = "E:E5027:กรุณาระบุเลขที่ทะเบียนรับ";
var E5028 = "E:E5028:กรุณาระบุประเทศส่งออก";
var E5029 = "E:E5029:กรุณาระบุราคา ณ โรงอุตสาหกรรม(ต้องมากกว่า 0.00)";
var E5030 = "E:E5030:ผลรวมของต้นทุนวัตถุดิบและค่าใช้จ่ายในการผลิต ต้องมากว่า 0.00";
var E5031 = "E:E5031:กรุณาระบุกำไร(ต้องมากว่า 0.00)";
var E5032 = "E:E5032:ราคาขาย ณ โรงงานอุตสาหกรรมไม่เท่ากับราคาขาย ณ โรงงานที่ใช้เป็นมูลค่าในการคำนวณภาษี";
var E5033 = "E:E5033:ราคาขาย ณ โรงงานอุตสาหกรรมน้อยกว่าราคาขาย ณ โรงงานที่ใช้เป็นมูลค่าในการคำนวณภาษี";
var E5034 = "E:E5034:ราคาขาย ณ โรงงานอุตสาหกรรมมากกว่าราคาขาย ณ โรงงานที่ใช้เป็นมูลค่าในการคำนวณภาษี";
var E5035 = "E:E5035:กรุณาระบุวันที่เริ่มใช้" ;
var E5036 = "E:E5036:ผลรวมของต้นทุนวัตถุดิบ หรือต้นทุนน้ำสุรา ต้องมากว่า 0.00";
var E5037 = "E:E5037:กรุณาระบุแรงงานทางตรง ต้องมากว่า 0.00";
var E5038 = "E:E5038:กรุณาระบุค่าใช้จ่ายในการผลิต ต้องมากว่า 0.00";
var E5039 = "E:E5039:ราคา ณ โรงงานสุราต่อหน่วยไม่เท่ากับราคาขาย ณ โรงงานสุราที่ใช้เป็นมูลค่าในการคำนวณภาษี";
var E5040 = "E:E5040:ราคา ณ โรงงานสุราต่อหน่วยน้อยกว่าราคาขาย ณ โรงงานสุราที่ใช้เป็นมูลค่าในการคำนวณภาษี";
var E5041 = "E:E5041:ราคา ณ โรงงานสุราต่อหน่วยมากกว่าราคาขาย ณ โรงงานสุราที่ใช้เป็นมูลค่าในการคำนวณภาษี";
var E5042 = "E:E5042:กรุณาระบุผู้อนุมัติ" ;
var E5043 = "E:E5043:กรุณาระบุรายการ" ;
var E5044 = "E:E5044:ผลรวมของค่าวัตถุทางตรง ต้องมากว่า 0.00" ;
var E5045 = "E:E5045:กรุณาระบุภาษี อบจ. ต้องมากว่า 0.00" ;
var E5046 = "E:E5046:กรุณาระบุภาษีมูลค่าเพิ่ม ต้องมากว่า 0.00" ;
var E5047 = "E:E5047:ราคา ณ โรงงานยาสูบต่อหน่วยไม่เท่ากับราคาขาย ณ โรงงานยาสูบที่ใช้เป็นมูลค่าในการคำนวณภาษี";
var E5048 = "E:E5048:ราคา ณ โรงงานยาสูบต่อหน่วยน้อยกว่าราคาขาย ณ โรงงานยาสูบที่ใช้เป็นมูลค่าในการคำนวณภาษี";
var E5049 = "E:E5049:ราคา ณ โรงงานยาสูบต่อหน่วยมากกว่าราคาขาย ณ โรงงานยาสูบที่ใช้เป็นมูลค่าในการคำนวณภาษี";
var E5050 = "E:E5050:วันที่ยืนแบบจะต้องไม่น้อยกว่าวันที่เริ่มจำหน่ายสินค้า";
var E5051 = "E:E5051:กรุณาระบุชื่อเครื่องหมายการค้า" ;
var E5052 = "E:E5052:กรุณาระบุชื่อบริษัท" ;
var E5053 = "E:E5053:กรุณาระบุลักษณะซอง" ;
var E5054 = "E:E5054:กรุณาระบุราคา CIF" ;
var E5055 = "E:E5055:กรุณาระบุราคาขายปลีก" ;
var E5056 = "E:E5056:ค่าการตลาด ต้องมากว่า 0.00" ;
var E5057 = "E:E5057:กรุณาระบุราคาค่าบริการ (ต้องมากกว่า 0.00)"; 

var E5901 = "E:E5901:รหัสกลุ่มสินค้าต้องเป็นตัวเลขเท่านั้น" ;
var E5902 = "E:E5902:รหัสประเภทสินค้า/บริการต้องเป็นตัวเลขเท่านั้น" ;
var E5903 = "E:E5903:รหัสเครื่องหมายการค้าหลักต้องเป็นตัวเลขเท่านั้น" ;
var E5904 = "E:E5904:รหัสเครื่องหมายการค้ารองต้องเป็นตัวเลขเท่านั้น" ;
var E5999 = "";
  
var E6001 = "E:E6001:รหัสซ้ำ";
var E6002 = "E:E6002:กรุณาระบุสถานะรายการ";
var E6003 = "E:E6003:กรุณาระบุรายการที่ต้องการลบ";
var E6004 = "E:E6004:ใบอนุญาตที่ออกเลขที่ใบอนุญาตแล้วไม่สามารถแก้ไขได้";
var E6005 = "E:E6005:ประเภทใบอนุญาตที่ยังไม่ออกเลขที่ใบอนุญาตไม่สามารถเพิกถอนได้";
var E6006 = "E:E6006:ประเภทใบอนุญาตที่ยังไม่ออกเลขที่ใบอนุญาตไม่สามารถยกเลิกได้";
var E6007 = "E:E6007:ประเภทใบอนุญาตที่ยังไม่ออกเลขที่ใบอนุญาตไม่สามารถออกใบแทนได้";
var E6008 = "E:E6008:ใบอนุญาตที่ออกเลขที่ใบอนุญาตแล้วไม่สามารถออกเลขที่ซ้ำ";
var E6009 = "E:E6009:ที่อยู่ของผู้ประกอบการรายนี้ตั้งอยู่ในบริเวณสถานที่ห้ามขาย";   
var E6010 = "E:E6010:จำนวนต้องมากกว่าศูนย์";     
var E6011 = "E:E6011:ไม่พบเลขที่ใบอนุญาตในฐานข้อมูล";        
var E6012 = "E:E6012:วันที่เริ่มต้นต้องไม่เกินวันที่สิ้นสุด"; 
var E6013 = "E:E6013:บันทึกเลขที่หนังสืออนุญาตแล้วไม่สามารถแก้ไขได้";            
var E6014 = "E:E6014:ประเภทใบอนุญาตที่ยังไม่ออกเลขที่ใบอนุญาตไม่สามารถพิมพ์ได้";     
var E6015 = "E:E6015:กรุณาบันทึก";     
        
var E6101 = "E:E6101:กรุณาระบุรหัสหนังสืออนุญาต";
var E6102 = "E:E6102:กรุณาระบุชื่อหนังสืออนุญาต";
var E6103 = "E:E6103:กรุณาระบุรหัสรสชาติ";
var E6104 = "E:E6104:กรุณาระบุชื่อรสชาติ";
var E6105 = "E:E6105:กรุณาระบุรหัสสาเหตุที่ยกเลิก";
var E6106 = "E:E6106:กรุณาระบุสาเหตุที่ยกเลิก";
var E6107 = "E:E6107:กรุณาระบุรหัสหน่วยงาน";
var E6108 = "E:E6108:กรุณาระบุชื่อหน่วยงาน";
var E6109 = "E:E6109:กรุณาระบุประเภทหน่วยงาน";
var E6110 = "E:E6110:กรุณาระบุรหัสพื้นที่";
var E6111 = "E:E6111:กรุณาระบุคำนำหน้าผู้ประกอบการ";
var E6112 = "E:E6112:กรุณาระบุชื่อผู้ประกอบการ";
var E6113 = "E:E6113:กรุณาระบุคำนำหน้าสถานประกอบการ";
var E6114 = "E:E6114:กรุณาระบุชื่อสถานประกอบการ";
var E6115 = "E:E6115:กรุณาระบุเลขที่ตั้ง";
var E6116 = "E:E6116:กรุณาระบุตำบล/แขวง";
var E6117 = "E:E6117:กรุณาระบุอำเภอ/จังหวัด";
var E6118 = "E:E6118:กรุณาระบุรหัสไปรษณีย์";
var E6119 = "E:E6119:กรุณาระบุตำแหน่งที่ตั้ง";
var E6120 = "E:E6120:เล่มที่ใบอนุญาตต้องไม่น้อยกว่าปีปัจจุบัน";   
var E6121 = "E:E6121:วันที่ต้องไม่น้อยกว่าวันที่ขออนุญาต";   
var E6122 = "E:E6122:ชื่อพันธุ์ต้นยาสูบซ้ำ";  
var E6123 = "E:E6123:ปีที่เพาะปลูกต้องไม่น้อยกว่าปีปัจจุบัน";  
var E6124 = "E:E6124:ชื่อพันธุ์ใบยาแห้งซ้ำ"; 
var E6125 = "E:E6125:ชื่อจังหวัดซ้ำ";    
var E6126 = "E:E6126:เล่มที่หนังสือสำคัญซ้ำ";    
var E6127 = "E:E6127:ชื่อไฟล์ไม่ถูกต้อง";    
var E6128 = "E:E6128:ไม่พบชื่อไฟล์ที่ต้องการโหลดข้อมูล";   
var E6129 = "E:E6129:ข้อมูลในไฟล์ไม่ถูกต้อง";
var E6130 = "E:E6130:ชื่อกลุ่มสินค้าซ้ำ";  
var E6131 = "E:E6131:ระบุรายละเอียดได้เฉพาะการขออนุญาตใช้ฉลาก";           
           
var E7001 = "E:E7001:วันที่ ต้องไม่มากกว่า วันปัจจุบัน";
var E7002 = "E:E7002:วันที่รับ ตั้งแต่ ต้องไม่มากกว่า วันที่รับ ถึง";
var E7003 = "E:E7003:ไม่สามารถเลือกรายการสินค้า ที่รหัสรายได้ต่างกัน";
var E7004 = "E:E7004:กรุณาเลือกรายการสินค้า";
var E7005 = "E:E7005:จำนวนเงินเครดิตภาษี ต้องไม่มากกว่า จำนวนเงินอนุมัติคงเหลือ";
var E7006 = "E:E7006:บันทึกได้เฉพาะตัวเลข และจุดทศนิยม 2 หลักเท่านั้น";
var E7007 = "E:E7007:เลขที่คุมเอกสารต้องมีขนาด 15 หลัก";
var E7008 = "E:E7008:รหัสรายได้ต้องมีขนาด 6 หลัก";
var E7009 = "E:E7009:รหัสศูนย์ต้นทุนเจ้าของรายได้ ต้องบันทึกเป็นตัวเลข 10 หลัก";
var E7010 = "E:E7010:รหัสบัญชีย่อย ต้องบันทึกเป็นตัวเลข 5 หลัก";
var E7011 = "E:E7011:วันที่ ตั้งแต่ ต้องไม่มากกว่า วันที่ ถึง";
var E7012 = "E:E7012:วันที่หนังสือค้ำประกัน ต้องไม่มากกว่า วันที่ของสัญญา";
var E7013 = "E:E7013:วันที่ของสัญญา ต้องอยู่ในช่วง วันที่อนุญาต วันที่สิ้นสุด ของใบอนุญาต";
var E7014 = "E:E7014:จำนวนเงินของสัญญา ไม่เท่ากับ จำนวนเงินของหนังสือค้ำประกัน";
var E7015 = "E:E7015:วันที่ขยายเวลา ต้องมากกว่า วันที่สิ้นสุดของสัญญา";
var E7016 = "E:E7016:วันที่เปลี่ยนหนังสือค้ำประกัน ต้องมากกว่า วันที่ของสัญญา";
var E7017 = "E:E7017:วันที่หนังสือค้ำประกัน ต้องไม่มากกว่า วันที่เปลี่ยนหนังหนังสือค้ำประกัน";
var E7018 = "E:E7018:รหัสแสตมป์ด้านซ้ายหลักที่ 1-2 ต้องมีขนาด 2 หลัก";
var E7019 = "E:E7019:รหัสแสตมป์ด้านซ้ายหลักที่ 3-6 ต้องมีขนาด 4 หลัก";
var E7020 = "E:E7020:รหัสแสตมป์ด้านขวาหลักที่ 1-2 ต้องมีขนาด 2 หลัก";
var E7021 = "E:E7021:รหัสแสตมป์ด้านขวาหลักที่ 3-6 ต้องมีขนาด 2 หลัก";
var E7022 = "E:E7022:จำนวนนำเข้า ต้องไม่มากกว่า จำนวนคงเหลือ";
var E7023 = "E:E7023:วันที่นำเข้า ต้องไม่มากกว่า นำเข้าได้ถึงวันที่";
var E7024 = "E:E7024:จำนวนแสตมป์(ดวง) ไม่เท่ากับ จำนวนยาสูบที่ชำระภาษี";
var E7025 = "E:E7025:ไม่พบ Mapping รหัสสินค้า กับ รหัสรายได้";
var E7026 = "E:E7026:จำนวนที่เปลี่ยนแปลง ต้องไม่น้อยกว่า จำนวนที่นำเข้าแล้ว";
var E7027 = "E:E7027:วันที่ทำรายการ ต้องไม่มากกว่า วันที่หมดอายุการนำเข้า";
var E7028 = "E:E7028:จำนวนที่ขออนุญาต ต้องเท่ากับ จำนวนที่ขอเปลี่ยนแปลง";
var E7029 = "E:E7029:วันที่ของสัญญา ต้องไม่มากกว่า วันที่ทำรายการ";
var E7030 = "E:E7030:ชำระทุกวันที่ ต้องอยู่ในช่วงวันที่ 1 ถึง 31";
var E7031 = "E:E7031:กรุณาสร้างตารางชำระ";
var E7032 = "E:E7032:วันที่อนุมัติ ต้องไม่มากกว่า วันที่สิ้นสุด";
var E7033 = "E:E7033:จำนวนเงินภาษีสรรพสามิตที่ชำระ น้อยกว่า จำนวนเงินคืนภาษี";
var E7034 = "E:E7034:จำนวนเงินภาษีเพื่อมหาดไทยที่ชำระ น้อยกว่า จำนวนเงินคืนภาษี";
var E7035 = "E:E7035:จำนวนเงินนำส่งกองทุน สสส. น้อยกว่า จำนวนเงินคืนภาษี";
var E7036 = "E:E7036:เลขที่ใบเสร็จรับเงินต้องมีขนาด 15 หลัก";
var E7037 = "E:E7037:ปี ต้องบันทึกเป็นตัวเลข 4 หลัก";
var E7038 = "E:E7038:ผู้ประกอบการ และรหัสรายได้ ต้องเหมือนกัน";
var E7039 = "E:E7039:เลขที่วิเคราะห์ต้องมีขนาด 15 หลัก";
var E7040 = "E:E7040:รายการนี้ชำระแล้ว ไม่สามารถเลือกได้";
var E7041 = "E:E7041:ไม่พบเลขทะเบียนสรรพสามิตที่ระบุ";
var E7042 = "E:E7042:เลขที่เช็คต้องมีขนาด 7 หลัก";
var E7043 = "E:E7043:วันที่เช็คน้อยกว่าวันที่ปัจจุบันได้ไม่เกิน 7 วัน";
var E7044 = "E:E7044:รวมจำนวนเงินที่ชำระ ไม่เท่ากับ รวมภาษีที่ต้องชำระ";
var E7045 = "E:E7045:จำนวนเงิน หักคืนภาษี มากกว่า ภาษีสรรพสามิตที่ชำระ";
var E7046 = "E:E7046:จำนวนเงิน หักคืนภาษี ไม่เท่ากับ จำนวนเงินเครดิตภาษี";
var E7047 = "E:E7047:จำนวนเงินเช็คขัดข้อง ไม่เท่ากับ จำนวนเงินที่ชำระ";
var E7048 = "E:E7048:รายการนี้ยังไม่ปิดสิ้นวัน ไม่สามารถทำรายการปรับปรุงได้";
var E7049 = "E:E7049:ไม่สามารถเลือกรหัสรายได้นี้ เนื่องจากไม่มีการเก็บภาษีมหาดไทย แต่รายการชำระมีการเก็บภาษีมหาดไทย";
var E7050 = "E:E7050:ไม่สามารถเลือกรหัสรายได้นี้ เนื่องจากรหัสแบบไม่ตรงกัน";
var E7051 = "E:E7051:รายการนี้ข้อมูลมาจากระบบงานอื่น ไม่สามารถทำรายการปรับปรุงได้";
var E7052 = "E:E7052:มีการบันทึกข้อมูลใบขนนี้แล้ว";
var E7053 = "E:E7053:รหัสสินค้า EDI ต้องมีขนาด 8 หลัก";
var E7054 = "E:E7054:ไม่พบข้อมูล Mapping รหัสประเทศ ของกรมศุลกากร กับกรมสรรพสามิต";
var E7055 = "E:E7055:ไม่พบข้อมูล Mapping รหัสหน่วยสินค้า ของกรมศุลกากร กับกรมสรรพสามิต";
var E7056 = "E:E7056:เลขที่ใบนำส่งต้องมีขนาด 16 หลัก";
var E7057 = "E:E7057:รายการนี้ปิดสิ้นวันแล้ว ไม่สามารถแก้ไขได้";
var E7058 = "E:E7058:รายการนี้บันทึกบัญชีแล้ว ไม่สามารถแก้ไขได้";
var E7059 = "E:E7059:ไม่พบรายการที่ยังไม่ได้พิมพ์ใบเสร็จรับเงิน";
var E7060 = "E:E7060:ไม่พบรายการพิมพ์บนแบบ (ยังไม่ได้พิมพ์ใบเสร็จรับเงิน)";
var E7061 = "E:E7061:ยังไม่ได้บันทึกบัญชีด้านรับเงินรายได้ ไม่สามารถบันทึกบัญชีด้านนำส่งเงิน";
var E7062 = "E:E7062:ยังไม่ได้ออกเลขที่ใบนำส่งเงิน ไม่สามารถบันทึกบัญชีด้านนำส่งเงิน";
var E7063 = "E:E7063:พบรายการใบเสร็จรับเงิน ที่มีการพิมพ์แล้ว";
var E7064 = "E:E7064:ไม่พบข้อมูลการปิดสิ้นวัน";
 
var E8001 = "E:E8001:กรุณาเลือกประเภทการขออนุญาต";
var E8002 = "E:E8002:กรุณาระบุจำนวนที่ขออนุมัติ";
var E8003 = "E:E8003:กรุณาระบุจำนวนภาษีที่ขออนุมัติ";
var E8004 = "E:E8004:กรุณาระบุผลการอนุมัติ";
var E8005 = "E:E8005:กรุณาระบุเลขที่อนุญาต กค.";
var E8006 = "E:E8006:กรุณาระบุชื่อผู้อนุมัติ";
var E8007 = "E:E8007:กรุณาระบุวันที่ที่อนุมัติ";
var E8008 = "E:E8008:กรุณาเลือกแบบที่จะขอคืน";
var E8009 = "E:E8009:กรุณาระบุจำนวนที่อนุมัติ";
var E8010 = "E:E8010:กรุณาระบุชื่อยานพาหนะ";
var E8011 = "E:E8011:กรุณาระบุตามเส้นทาง";
var E8012 = "E:E8012:กรุณาระบุภายในวันที่";
var E8013 = "E:E8013:กรุณาระบุวันที่ส่งออกจริง";
var E8014 = "E:E8014:กรุณาระบุวันที่เก็บเข้าคลังสินค้าทัณฑ์บน/โรงอุตสาหกรรม";
var E8015 = "E:E8015:กรุณาระบุจำนวนสินค้าที่รับจริง";
var E8016 = "E:E8016:กรุณาเลือกรายการสินค้า";
var E8017 = "E:E8017:กรุณาเลือกรายการใบเสร็จรับเงิน";
var E8018 = "E:E8018:กรุณาระบุจำนวนเงินที่จะขอคืน";
var E8019 = "E:E8019:กรุณาระบุตรายี่ห้อ";
var E8020 = "E:E8020:กรุณาระบุภาชนะบรรจุ";
var E8021 = "E:E8021:กรุณาระบุขนาด";
var E8022 = "E:E8022:กรุณาระบุแหล่งผลิต";
var E8023 = "E:E8023:กรุณาระบุส่วนราชการ/โรงพยาบาล/องค์การสาธารณกุศล";
var E8024 = "E:E8024:กรุณาระบุจำนวนเตียงคนไข้";
var E8025 = "E:E8025:กรุณาระบุจำนวนรถพยาบาลที่มีอยู่";
var E8026 = "E:E8026:กรุณาระบุหมายเลขเครื่องยนต์";
var E8027 = "E:E8027:กรุณาระบุหมายเลขแซสซีย์";
var E8028 = "E:E8028:กรุณาระบุความจุกระบอกสูบ";
var E8029 = "E:E8029:กรุณาระบุความกว้าง/ยาว";

var W0001 = "W:W0001:ต้องการลบข้อมูลหรือไม่" ;
var W0002 = "W:W0002:ต้องการจบการทำงานหรือไม่" ;
var W0003 = "W:W0003:ต้องการบันทึกข้อมูลหรือไม่" ;

var W4001 = "W:W4001:วันที่เริ่มประกอบการ จะต้องน้อยกว่าหรือเท่ากับวันที่ยื่นแบบ";
var W4002 = "W:W4002:วันที่จดทะเบียนใหม่เกินระยะเวลาที่กฏหมายกำหนด";
var W4003 = "W:W4003:กรุณาเลือกพิมพ์สำเนา"; // ให้ต่อด้วย ภษ.01-06 หรือ ภษ.01-07 หรือ อื่นๆ
var W4004 = "W:W4004:พิมพ์ใบทะเบียน ภษ.02-04"; 
var W4005 = "W:W4005:กรุณาเลือกพิมพ์ใบอนุญาต"; // ให้ต่อด้วย ภษ.02-05 หรือ 02-05 ก
var W4006 = "W:W4006:มีการพิมพ์ใบทะเบียน ภษ.02-04 เรียบร้อยแล้ว ต้องการพิมพ์ซ้ำหรือไม่"; 
var W4007 = "W:W4007:มีการพิมพ์ใบอนุญาต ภษ.02-05 เรียบร้อยแล้ว ต้องการพิมพ์ซ้ำหรือไม่"; 
var W4008 = "W:W4008:มีการพิมพ์ใบอนุญาต ภษ.02-05ก เรียบร้อยแล้ว ต้องการพิมพ์ซ้ำหรือไม่"; 
var W4009 = "W:W4009:มีการพิมพ์ใบทะเบียน ภษ.02-04 เรียบร้อยแล้ว ต้องการแก้ไขข้อมูลใหม่หรือไม่";
var W4010 = "W:W4010:มีการพิมพ์ใบอนุญาต ภษ.02-05 เรียบร้อยแล้ว ต้องการแก้ไขข้อมูลใหม่หรือไม่";
var W4011 = "W:W4011:มีการพิมพ์สัญญาคลังสินค้าทัณฑ์บน เรียบร้อยแล้ว  ต้องการพิมพ์ซ้ำหรือไม่";  
var W4012 = "W:W4012:ถ้าไม่มีเอกสารแนบให้ระบุ 0 เท่านั้น";  
var W4013 = "W:W4013:มีการพิมพ์ใบอนุญาต ภษ.02-05ก เรียบร้อยแล้ว ต้องการแก้ไขข้อมูลใหม่หรือไม่";

var W6001 = "W:W6001:ผู้ประกอบการรายนี้เคยถูกเพิกถอนใบอนุญาต" ;
var W6002 = "W:W6001:ผู้ประกอบการรายนี้เคยเป็นผู้กระทำความผิด" ;
var W6003 = "W:W6001:ผู้ประกอบการรายนี้เคยขอใบอนุญาต" ;

var W7001 = "W:W7001:ต้องการสร้างตารางชำระใหม่ ใช่หรือไม่";

var W8001 = "W:W8001:เกินอำนาจอนุมัติไม่สามารถทำการอนุมัติได้ ต้องการแก้ไขหรือไม่" ;

var I0001 = "I:I0001:บันทึกข้อมูลเรียบร้อยแล้ว";
var I0002 = "I:I0002:ลบข้อมูลเรียบร้อยแล้ว";
var I0003 = "I:I0003:ไม่สามารถบันทึกข้อมูลได้";
var I0004 = "I:I0004:ไม่พบข้อมูลตามเงื่อนไขที่ระบุ";     
var I0005 = "I:I0005:ไม่สามารถลบข้อมูลได้";
var I0006 = "I:I0006:ท่านไม่มีสิทธิเข้าใช้ระบบงาน";
var I0007 = "I:I0007:เกิดข้อผิดพลาดขณะค้นหาข้อมูล";
var I0008 = "I:I0008:ยกเลิกแบบเรียบร้อยแล้ว";
var I0009 = "I:I0009:ยื่นยันการบันทึกข้อมูล";
var I0010 = "I:I0010:ยื่นยันการลบข้อมูล";
var I0011 = "I:I0011:กำลังประมวลผลกรุณารอสักครู่";
//var I0012 = "I:I0012:ท่านได้ดำเนินการบันทึกแบบคำขอกู้ยืมเงิน เรียบร้อยแล้ว\nรอสถานศึกษาประกาศรายชื่อ";
var I0012 = "I:I0012:ท่านได้ดำเนินการบันทึกแบบคำขอกู้ยืมเงิน เรียบร้อยแล้ว\nโปรดรอสถานศึกษาทำการคัดเลือก และประกาศรายชื่อ";
//var I0013 = "I:I0013:ท่านได้ดำเนินการบันทึกแบบยืนยันการขอกู้ยืมเงิน เรียบร้อยแล้ว\nรอสถานศึกษาลงทะเบียนเรียน";
var I0013 = "I:I0013:โปรดติดต่อกับทางสถานศึกษาของท่าน เพื่อสถานศึกษาจะได้ดำเนินการขั้นตอนต่อไป";
var I0014 = "I:I0014:สัญญาทำเฉพาะผู้กู้รายใหม่ หรือเปลี่ยนระดับการศึกษาเท่านั้น";
var I0015 = "I:I0015:รอประกาศรายชื่อผู้มีสิทธิกู้ยืม จากสถานศึกษา";
var I0016 = "I:I0016:ไม่สามารถบันทึกข้อมูลได้ \nเนื่องจาก จำนวนเงินค่าเล่าเรียน ค่าใช้จ่ายเกี่ยวเนื่องกับการศึกษา และค่าครองชีพ ไม่เท่ากับ จำนวนเงินรวมทั้งสิ้น \nกรุณาตรวจสอบ ความตรวจสอบความถูกต้องของข้อมูล ก่อนทำการบันทึกอีกครั้ง";
var I0017 = "I:I0017:ไม่สามารถบันทึกข้อมูลได้ \nเนื่องจากไม่พบเลขที่สัญญา";
var I0018 = "I:I0018:ไม่สามารถบันทึกข้อมูลได้ \nเนื่องจากไม่พบสถานะผู้กู้ยืมรายเก่า หรือรายใหม่";
var I0019 = "I:I0019:ไม่สามารถบันทึกข้อมูลได้ \nเนื่องจากไม่พบระดับการศึกษาของผู้กู้ยืม";
var I0020 = "I:I0020:ไม่สามารถบันทึกข้อมูลได้ \nเนื่องจากไม่พบเลขที่บัญชีของสถานศึกษา";
var I0021 = "I:I0021:ไม่สามารถบันทึกข้อมูลได้ \nเนื่องจากไม่พบรหัสธนาคารของสถานศึกษา";
var I0022 = "I:I0022:ไม่สามารถบันทึกข้อมูลได้ \nเนื่องจากไม่พบชื่อสาขาธนาคารของสถานศึกษา";
var I0023 = "I:I0023:ไม่สามารถบันทึกข้อมูลได้ \nเนื่องจากไม่พบชื่อบัญชีธนาคารของผู้กู้ยืม";
var I0024 = "I:I0024:ไม่สามารถบันทึกข้อมูลได้ \nเนื่องจากไม่พบเลขที่บัญชีของผู้กู้ยืม";
var I0025 = "I:I0025:ไม่สามารถบันทึกข้อมูลได้ \nเนื่องจากไม่พบรหัสสาขาธนาคารของผู้กู้ยืม";
var I0026 = "I:I0026:ไม่สามารถบันทึกข้อมูลได้ \nเนื่องจากไม่พบชื่อสาขาธนาคารของผู้กู้ยืม";






var I4001 = "I:I4001:กรุณาระบุข้อมูลเพื่อใช้ในการค้นหา";
var I4002 = "I:I4002:เคยถูกเพิกถอนใบอนุญาตและยังไม่เกิน 3 ปี"; 
var I4003 = "I:I4003:ไม่พบข้อมูลการเคยถูกเพิกถอนใบอนุญาต";
var I4004 = "I:I4004:ไม่พบข้อมูลการการค้างจดทะเบียนสรรพสามิตใหม่"; 
var I4005 = "I:I4005:ไม่พบข้อมูลการใช้บริการผ่านทาง internet"; 
  
var I6001 = "I:I6001:โหลดข้อมูลเรียบร้อยแล้ว";   
var I6002 = "I:I6002:เกิดข้อผิดพลาดขณะโหลดข้อมูล";
var I6003 = "I:I6003:เกิดข้อผิดพลาดขณะ Upload ไฟล์";

var I7001 = "I:I7001:ยอดเงินภาษีสรรพสามิตที่ชำระจริง ไม่เท่ากับยอดเงินภาษีสรรพสามิตที่ต้องชำระ"
var I7002 = "I:I7002:ยอดเงินภาษีเพื่อมหาดไทยที่ชำระจริง ไม่เท่ากับยอดเงินภาษีเพื่อมหาดไทยที่ต้องชำระ"
var I7003 = "I:I7003:รับชำระหลังปิดสิ้นวัน";
var I7004 = "I:I7004:กรุณาเลือกรายการพิมพ์";
var I7005 = "I:I7005:ยืนยันการพิมพ์ใบเสร็จ";
var I7006 = "I:I7006:ยืนยันการพิมพ์บนแบบ";
var I7007 = "I:I7007:ปรมวลผลเรียบร้อยแล้ว";
var I7008 = "I:I7008:ยกเลิกการปิดสิ้นวันเรียบร้อยแล้ว";
var I7009 = "I:I7009:ไม่พบข้อมูลปิดงานสิ้นวัน";
var I7010 = "I:I7010:ยืนยันการพิมพ์ใบเสร็จเสีย";


var I8001 = "I:I8001:ไม่สามารถทำการบันทึกข้อมูลได้ เนื่องจากข้อมูลได้รับการอนุมัติเรียบร้อยแล้ว";
var I8002 = "I:I8002:วันที่ขอคืนเกิน 60 วัน กรุณาทำการขยายเวลา";
var I8003 = "I:I8003:ไม่สามารถทำการลบข้อมูลได้ เนื่องจากข้อมูลได้รับการอนุมัติเรียบร้อยแล้ว";
var I8004 = "I:I8004:ไม่สามารถเรียกดูข้อมูลได้เนื่องจากเป็นรายการที่ไม่มีโครงสร้างต้นทุน";
	
var I9001 = "I:I9001:ไม่สามารถลบข้อมูลได้ เนื่องจากจำนวนผู้กู้ถูกใช้ไปแล้ว";
var I9002 = "I:I9002:ไม่สามารถลบข้อมูลได้ เนื่องจากค่าเล่าเรียน และค่าใช้จ่ายเกี่ยวเนื่องฯ ถูกใช้ไปแล้ว";
var I9003 = "I:I9003:ไม่สามารถแก้ไขจำนวนผู้กู้ได้เนื่องจากว่าจำนวนผู้กู้ที่จัดสรรให้ใหม่มีค่า\nน้อยกว่าผู้กู้ที่ใช้ไป";
var I9004 = "I:I9004:ไม่สามารถแก้ไขค่าเล่าเรียนและค่าใช้จ่ายเกี่ยวเนื่อง ฯ เนื่องจากว่า\nค่าเล่าเรียนและค่าใช้จ่ายเกี่ยวเนื่องฯ ที่จัดสรรให้ใหม่มีค่า\n น้อยกว่าค่าเล่าเรียนและค่าใช้จ่ายเกี่ยวเนื่องที่ใช้ไป";
var I9005 = "I:I9005:ไม่สามารถแก้ไขจำนวนผู้กู้ได้เนื่องจากว่าจำนวนผู้กู้ที่จัดสรรให้ใหม่มีค่า\nมากกว่ายอดคงเหลือ";
var I9006 = "I:I9006:ไม่สามารถแก้ไขค่าเล่าเรียนและค่าใช้จ่ายเกี่ยวเนื่อง ฯ เนื่องจากว่า\nค่าเล่าเรียนและค่าใช้จ่ายเกี่ยวเนื่องฯ ที่จัดสรรให้ใหม่มีค่า\n มากกว่ายอดคงเหลือ";
var I9007 = "I:I9007:ไม่สามารถเพิ่มจำนวนผู้กู้เนื่องจากว่าจำนวนผู้กู้ที่จัดสรรให้ใหม่\nมากกว่ายอดคงเหลือ";
var I9008 = "I:I9008:ไม่สามารถเพิ่มค่าเล่าเรียนและค่าใช้จ่ายเกี่ยวเนื่อง ฯ เนื่องจากว่า\nยอดที่เพิ่มไปใหม่มีค่ามากกว่ายอดคงเหลือ";
///////////////////////////////////////////////// Error_Warning.js ////////////////////////////////
var messageLanguage = 2;
// Insert by Prawith
// กรณีหลาย ๆ Field ที่มี Err เหมือนกัน
// เช่น อัตราชดเชยกรมศุลฯ และ อัตรานำส่งกองทุน
// ค่าที่บันทึกได้ต้องไม่เกิน 100.00
function showMsgField( code, field ) {

     arr = code.split(":");
     typDesc = getTypeDesc(arr[0]); 
     mesg = typDesc + "\n\n" + arr[1] + ": " + field + " " + arr[messageLanguage] + "";
     return mesg;
}
function showMsg( code ){

     arr = code.split(":");
     typDesc = getTypeDesc(arr[0]); 
     mesg = typDesc + "\n" + "\n" + arr[1] + ": " + arr[messageLanguage] + "";
     return mesg;
}

function getTypeDesc(codeType) {
	strType = "";
	if( codeType == "W" ) {
		if( messageLanguage == 2 ){
		     strType = "ข้อความเตือน";
		} else {
			 strType = "Warning";
		}
	}	
	if( codeType == "E" ) {
		if( messageLanguage == 2 ){
		     strType = "ข้อความปฏิเสธ";
		} else {
			 strType = "Error";
		}
	}
	if( codeType == "I" ) {
		if( messageLanguage == 2 ){
		     strType = "Information";
		} else {
			 strType = "Information";
		}
	}
	
	return strType;
}
/**
* ส่ง parameter :  param = E#E7011:วันที่รับ ตั้งแต่ ต้องไม่มากกว่า วันที่รับ ถึง
* การเรียกใช้ message ที่ jsp คือ alert(showMessage(param));
* เหตุผลการสร้าง การเรียกใช้ Function กลาง อาจทำให้มีการใช้ message code ที่แตกต่างกัน
**/
function showMessage( message ){

     arr = message.split("#");
     typHead = getTypeDesc(arr[0]); 
     typDesc = arr[1];
     mesg = typHead + "\n" + "\n" + arr[1];
     return mesg;
}

//Nattakrit c.
